# Cohort Analysis

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('data.csv', engine='python', encoding = 'ISO8859-1' )
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

### Reformat Timestamp

In [5]:
import dateutil
from datetime import datetime as dt
from pytz import utc

In [10]:
df['Datetime'] = df['InvoiceDate'].apply(lambda x : dateutil.parser.parse(x).timestamp())
df['Month'] = df['Datetime'].apply(lambda x : dt.fromtimestamp(x,utc).month)
df['Year'] = df['Month'].apply(lambda x : dt.fromtimestamp(x,utc).year)

In [11]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Datetime,Month,Year
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,1.291163e+09,12,1970
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,1.291163e+09,12,1970
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,1.291163e+09,12,1970
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,1.291163e+09,12,1970
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,1.291163e+09,12,1970

### Cohort

In [18]:
df['cohort'] = df.apply(lambda row : (row['Year']*100)+(row['Month']), axis=1)
cohorts = df.groupby('CustomerID')['cohort'].min().reset_index()
cohorts.columns = ['CustomerID', 'transaksi_pertama']
df = df.merge(cohorts, on='CustomerID', how='left')

In [19]:
cohorts.head()

   CustomerID  transaksi_pertama
0     12346.0             197001
1     12347.0             197001
2     12348.0             197001
3     12349.0             197011
4     12350.0             197002

In [20]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Datetime,Month,Year,cohort,transaksi_pertama_x,transaksi_pertama_y
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,1.291163e+09,12,1970,197012,197002.0,197002.0
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,1.291163e+09,12,1970,197012,197002.0,197002.0
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,1.291163e+09,12,1970,197012,197002.0,197002.0
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,1.291163e+09,12,1970,197012,197002.0,197002.0
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,1.291163e+09,12,1970,197012,197002.0,197002.0

### Header setiap cohort

In [29]:
headers = df['cohort'].value_counts().reset_index()
headers.columns = ['Cohorts', 'Count']
headers.head()

   Cohorts  Count
0   197011  84711
1   197012  68006
2   197010  60742
3   197009  50226
4   197007  39518

In [30]:
headers = headers.sort_values(['Cohorts'])['Cohorts'].to_list()
headers

[197001,
 197002,
 197003,
 197004,
 197005,
 197006,
 197007,
 197008,
 197009,
 197010,
 197011,
 197012]

### Pivot Data

In [50]:
df.head()

AttributeError: 'NoneType' object has no attribute 'head'

In [49]:
df.isna().sum()

AttributeError: 'NoneType' object has no attribute 'isna'

In [34]:
df.duplicated().sum()

5268

In [47]:
df.dropna(inplace=True)

AttributeError: 'NoneType' object has no attribute 'dropna'

In [48]:
df.isna().sum()

AttributeError: 'NoneType' object has no attribute 'isna'

In [46]:
df = df.drop_duplicated()

AttributeError: 'NoneType' object has no attribute 'drop_duplicated'